results/results_r5_large/results_r5_large_run1/oltp_read_write_t32/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 54.39 qps: 1124.39 (r/w/o: 792.55/57.59/274.25) lat (ms,95%): 926.33 err/s: 0.10 reconn/s: 0.00
[ 20s ] thds: 32 tps: 51.20 qps: 1017.43 (r/w/o: 711.02/53.20/253.21) lat (ms,95%): 960.30 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 56.30 qps: 1123.80 (r/w/o: 786.30/58.50/279.00) lat (ms,95%): 926.33 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 55.60 qps: 1115.50 (r/w/o: 781.90/57.50/276.10) lat (ms,95%): 909.80 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 55.40 qps: 1106.90 (r/w/o: 774.00/59.10/273.80) lat (ms,95%): 926.33 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 53.70 qps: 1074.90 (r/w/o: 752.30/57.30/265.30) lat (ms,95%): 960.30 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 32 tps: 51.00 qps: 1027.00 (r/w/o: 721.00/54.60/251.40) lat (ms,95%): 943.16 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 49.70 qps: 992.70 (r/w/o: 694.30/52.70/245.70) lat (ms,95%): 1089.30 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 32 tps: 54.80 qps: 1094.71 (r/w/o: 765.00/59.60/270.10) lat (ms,95%): 943.16 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 54.50 qps: 1091.90 (r/w/o: 764.90/57.60/269.40) lat (ms,95%): 926.33 err/s: 0.10 reconn/s: 0.00
[ 110s ] thds: 32 tps: 55.70 qps: 1107.50 (r/w/o: 775.30/58.40/273.80) lat (ms,95%): 909.80 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 32 tps: 55.80 qps: 1116.60 (r/w/o: 781.50/60.70/274.40) lat (ms,95%): 926.33 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            91206
        write:                           6900
        other:                           32180
        total:                           130286
    transactions:                        6513   (53.98 per sec.)
    queries:                             130286 (1079.74 per sec.)
    ignored errors:                      2      (0.02 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      53.9760
    time elapsed:                        120.6646s
    total number of events:              6513

Latency (ms):
         min:                                  227.65
         avg:                                  591.70
         max:                                 1412.89
         95th percentile:                      943.16
         sum:                              3853725.90

Threads fairness:
    events (avg/stddev):           203.5312/3.75
    execution time (avg/stddev):   120.4289/0.18